Revit 2027 API
ThemeChangedEventArgs.ThemeChangedType Property
 Get the application frame theme Type.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ThemeType ThemeChangedType { get; }
Public ReadOnly Property ThemeChangedType As ThemeType
	Get
public:
property ThemeType ThemeChangedType {
	ThemeType get ();
}
member ThemeChangedType : ThemeType with get
Property Value
ThemeType
See Also
Reference
ThemeChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace